---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
HVACLoadBuildingType..::..IsNameUnique Method
HVACLoadBuildingType Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IsNameUnique(String) | Determines whether a potential building type name is unique. |
|  | IsNameUnique(Document, String) | Determines whether a potential building type name is unique. |

# See Also

HVACLoadBuildingType Class

HVACLoadBuildingType Members

Autodesk.Revit.DB.Analysis Namespace